Revit 2027 API
FabricationServiceButton.ContainsFabricationPartType Method
 Checks to see if the fabrication part type exists on one of the button conditions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ContainsFabricationPartType(
	FabricationPartType partType
)
Public Function ContainsFabricationPartType (
	partType As FabricationPartType
) As Boolean
public:
bool ContainsFabricationPartType(
	FabricationPartType^ partType
)
member ContainsFabricationPartType :
        partType : FabricationPartType -> bool
Parameters
partType FabricationPartType
 The fabrication part type to check.
Return Value
Boolean
 Returns true if the fabrication part type exists on the fabrication service button.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace